DataProcessors/ЗагрузитьЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузитьЗаявки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКХранилищуФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Необработана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Заявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Заявки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПрикрепленныеФайлы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветПользователю</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрикрепленныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ЗагрузитьЗаявки/Ext/ObjectModule.bsl
&НаСервере
Процедура ЗагрузитьЗаявкиНаСервере() Экспорт
	мПараметры = ОбщийПодключение.ПолучитьПараметрыПодключения();
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.Пользователь = мПараметры.Пользователь;
	Профиль.Пароль = мПараметры.Пароль;
	Профиль.АдресСервераPOP3 = мПараметры.АдресСервера;
	ПРофиль.АутентификацияPOP3 = СпособPOP3Аутентификации.Обычная;
	МассивПисем = Новый массив();
	Попытка
		Почта = Новый ИнтернетПочта;
		Почта.Подключиться(Профиль);
		ОбработатьЗаявки(Почта.Выбрать(Ложь));
	Исключение
		Сообщить("Ошибка получения почты " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗаявки(МассивПисем)
	МассивEmail = ПолучитьEmailПользователей();
	Для каждого стрПисьмо Из МассивПисем Цикл 
		Сообщить(стрПисьмо.Отправитель.Адрес);
		Если МассивEmail.Найти(стрПисьмо.Отправитель.Адрес)<>Неопределено Тогда 		
			СоздатьНовуюЗаявку(стрПисьмо);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьEmailПользователей();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Email КАК Email
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивПользователей = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивПользователей.Добавить(ВыборкаДетальныеЗаписи.Email);
	КонецЦикла;
	Возврат МассивПользователей;
КонецФункции

&НаСервере
Процедура СоздатьНовуюЗаявку(Письмо)
	Для каждого ЭлементТекста Из Письмо.Тексты Цикл 
		Если ЭлементТекста.ТипТекста = ТипТекстаПочтовогоСообщения.HTML Тогда 
			ТекстЗаявки = ЭлементТекста.Текст;
		КонецЕсли;
	КонецЦикла;
	ТекстЗаявки = ОбщийЗаявки.ПреобразоватьТекстЗаявки(ТекстЗаявки);
	НоваяЗаявка = Документы.Заявки.СоздатьДокумент();
	НоваяЗаявка.Дата = Письмо.ДатаПолучения;
	НоваяЗаявка.Записать();//Номер для присваивания каталога для хранения файлов
	СоздатьКаталог(ПутьКХранилищуФайлов+"\"+НоваяЗаявка.Номер);
	НоваяЗаявка.ТемаЗаявки = ОбщийЗаявки.ПреобразоватьТемуЗаявки(Письмо.Тема);
	НоваяЗаявка.Инициатор = ОбщийЗаявки.НайтиИнициатораЗаявки(ТекстЗаявки);
	НоваяЗаявка.СтатусЗаявки = Перечисления.СтатусыЗаявок.Необработана;
	НоваяЗаявка.Приоритет = ОбщийЗаявки.ПолучитьПоследнююПриоритет()+1;
	
	Счетчик=0;
	Для каждого Вложение Из Письмо.Вложения Цикл 
		ПутьСохраненияФайла = ПутьКХранилищуФайлов+"\"+НоваяЗаявка.Номер+"\"+Вложение.ИмяФайла;
		ХранилищеФайла = Новый ХранилищеЗначения(Вложение.Данные);
		ДвоичныеДанные = ХранилищеФайла.Получить();
		ДвоичныеДанные.Записать(ПутьСохраненияФайла);
		НовыйФайл = НоваяЗаявка.ПрикрепленныеФайлы.Добавить();	
		НовыйФайл.ПутьКФайлу = ПутьСохраненияФайла;	
		НовыйФайл.ИмяФайла = Вложение.ИмяФайла;			
		ТекстЗаявки = СтрЗаменить(ТекстЗаявки,"cid:"+Вложение.Идентификатор,ПутьСохраненияФайла);
	КонецЦикла;
	
	НоваяЗаявка.ТелоЗаявки = ТекстЗаявки;	
	НоваяЗаявка.Записать();
КонецПроцедуры
